<?php
if (isset($_POST['login'])) { $login = $_POST['login']; if ($login == '') { unset($login);} }
//заносим введенный пользователем логин в переменную $login, если он пустой, то уничтожаем переменную
if (isset($_POST['password'])) { $password=$_POST['password']; if ($password =='') { unset($password);} }
//заносим введенный пользователем пароль в переменную $password, если он пустой, то уничтожаем переменную
if    (isset($_POST['email'])) { $email = $_POST['email']; if ($email == '') {    unset($email);} }
//заносим введенный пользователем e-mail, если он    пустой, то уничтожаем переменную
 if    (empty($login) or empty($password) or empty($email))
            //добавим    переменную с e-mail адресом
            //если    пользователь не ввел логин или пароль, то выдаем ошибку и останавливаем    скрипт
            {
            exit    ("Вы ввели не всю информацию, вернитесь назад и заполните все    поля!");
            //останавливаем    выполнение сценариев
            }
            if    (!preg_match("/[0-9a-z_]+@[0-9a-z_^\.]+\.[a-z]{2,3}/i", $email))
            //проверка    е-mail адреса регулярными выражениями на корректность
            {exit    ("Неверно введен е-mail!");}
// Обработка кода капчи
session_start();
if(isset($_SESSION['captcha_keystring']) && $_SESSION['captcha_keystring'] !=  $_POST['keystring'])
{
exit ("<html><head><meta http-equiv='Refresh' content='5; URL=страница регистрации.php'>
</body></html>
Защитный код из 7 цифр введен неверно, пожалуйста, будьте внимательней!
Вы будете перемещены обратно на страницу регистрации через 5 секунд.
Если не хотите ждать, нажмите на ссылку <a href="index.php">
 Вернуться
 </a>");
  //останавливаем выполнение сценариев
}
?>
