<?php
//если логин и пароль введены,то обрабатываем их, чтобы теги и скрипты не работали, мало ли что люди могут ввести
$login = stripslashes($login);
$login = htmlspecialchars($login);
$password = stripslashes($password);
$password = htmlspecialchars($password);
//удаляем лишние пробелы
$login = trim($login);
$password = trim($password);
 
// дописываем новое********************************************
 
//добавляем проверку на длину логина и пароля
if (strlen($login) < 5 or strlen($login) > 15) {
exit ("Логин должен состоять не менее чем из 5 символов и не более чем из 15.");
//останавливаем выполнение сценариев
}
if (strlen($password) < 6 or strlen($password) > 15) {
exit ("Пароль должен состоять не менее чем из 6 символов и не более чем из 15.");
 //останавливаем выполнение сценариев
}
$password = md5($password);
//шифруем пароль
$password = strrev($password);
// для надежности добавим реверс
$password = $password."здесь любой набор символов и цифр например "2fggi4lj";
//Если этот пароль будут взламывать методом подбора у себя
на сервере этой же md5,то явно ничего хорошего не выйдет.
 Но советую ставить другие символы, можно в начале
 строки или в середине.
//При этом необходимо увеличить длину поля password в базе.
 Зашифрованный пароль может получится гораздо большего размера.
// дописали новое********************************************
// Далее идет все из первой части статьи,но необходимо дописать изменение в запрос к базе.
// подключаемся к базе
include ("путь к файлу с подключением к бд.php");// например файл bd.php
 должен быть в той же папке, что и все остальные, если это не так,
 то просто измените путь
// проверка на существование пользователя с таким же логином
$result = mysql_query("SELECT id FROM user WHERE login='$login'",$db);
$myrow = mysql_fetch_array($result);
if (!empty($myrow['id'])) {
exit ("Извините, введённый вами логин уже зарегистрирован. Введите другой логин.");
 //останавливаем выполнение сценариев
}
// если такого нет, то сохраняем данные
$reg_date = date("d-m-Y в H:i");
$result2 = mysql_query ("INSERT INTO user (login,password,avatar,email,reg_date) VALUES('$login','$password','$avatar','$email','$reg_date')");
?>
